#  Introduction to Pandas
<hr>

`Pandas` is one of the most important data analysis tools in Python for data processing. Built on NumPy, it offers many methods for handling large datasets and allows flexible, efficient data manipulation.

The main data type used in pandas is the `DataFrame`, which is a two-dimensional structure similar to a table in Excel. To use pandas, you first need to import it. In fact, the name 'Pandas' is short for 'panel data'.

In [360]:
import pandas as pd

##  Creating, Reading, and Storing Data
<hr>

### Creating Data
<hr>

For example, consider the following data:
    
 Name|Statistics |Accounting |Makerting
 |:--------:|:--------:|:--------:|:--------:|
 Jim | 85 | 82 | 84  
 Lily | 68 | 63 | 90 
 Jack | 90 | 88 | 78 |

In general, there are two ways to create a DataFrame.

- Create the DataFrame by dictionaries `dict`.
- Create the DataFrame by an `NumPy ndarray` and a parameter `columns`.

In [361]:
import pandas as pd

df = pd.DataFrame(
    {
        "Name": ["Jim", "Lily", "Jack"],
        "Statistics": [85, 68, 90],
        "Accounting": [82, 63, 88],
        "Marketing": [84, 90, 78],
    }
)
print(df)

   Name  Statistics  Accounting  Marketing
0   Jim          85          82         84
1  Lily          68          63         90
2  Jack          90          88         78

In [362]:
import pandas as pd
import numpy as np

data = np.array([["Jim", 85, 82, 84],
        ["Lily", 68, 63, 90],
        ["Jack", 90, 88, 78]])
df = pd.DataFrame(data, columns = ["Name", "Statistics", "Accounting", "Marketing"])
df

   Name Statistics Accounting Marketing
0   Jim         85         82        84
1  Lily         68         63        90
2  Jack         90         88        78

In [363]:
df['Accounting'].astype(float)

0    82.0
1    63.0
2    88.0
Name: Accounting, dtype: float64

In the above outputs, the first row are column lables while the first column are row indices. We can visit them by ``columns`` and ``index``, respectively.

In [364]:
df.columns

Index(['Name', 'Statistics', 'Accounting', 'Marketing'], dtype='object')

In [365]:
df.index

RangeIndex(start=0, stop=3, step=1)

- One column data of a DataFrame is called a `Series`.

In [366]:
type(df['Statistics'])

pandas.core.series.Series

Pandas also supports converting one-dimensional or two-dimensional arrays/lists directly into DataFrame format.

In [390]:
a = [1, 2, 3]
pd.DataFrame(a)

   0
0  1
1  2
2  3

In [391]:
a = [[1, 2, 3], [4, 5, 6]]
pd.DataFrame(a)

   0  1  2
0  1  2  3
1  4  5  6

### Reading Data
<hr>

In most cases, we need to read data files (such as Excel files). Suppose the example above is saved in an Excel file named 'transcripts.xlsx' located in the "datas/" directory on your computer. We can read the file using the `read_excel` method:

```python
import pandas as pd

df = pd.read_excel("datas/transcripts.xlsx")
# or df = pd.read_excel("datas\\transcripts.xlsx")
# or df = pd.read_excel(r"datas\transcripts.xlsx")
```

```{note}
- File paths on macOS use the forward slash `/` as a separator, while Windows uses the backslash `\`.

- Adding an `r` before a file path string (e.g., r"path") preserves the original meaning of the string and prevents special characters from being escaped.
```

The syntax for ``read_excel``is:

<table>   
    <tr style="border-top:solid; border-bottom:solid">
        <th colspan=2 style="text-align:center">
            read_excel(io, sheetname=0, header=0, skiprows=None, index_col=None, encoding=None)
        </th>
    </tr>
    <tr>
        <td style="text-align:left">io</td>
        <td style="text-align:left">The file path and name of the data file, usually provided as a string.</td>
    </tr>
    <tr>
        <td style="text-align:left">sheetname</td>
        <td style="text-align:left">The name or index of the worksheet. Defaults to 0, which reads the first sheet.</td>
    </tr>
    <tr>
        <td style="text-align:left">header</td>
        <td style="text-align:left">The row to use as column names. Defaults to 0, meaning the first row is used as headers.</td>
    </tr>
    <tr>
        <td style="text-align:left">skiprows</td>
        <td style="text-align:left">Number of rows to skip from the top of the file.</td>
    </tr>
    <tr>
        <td style="text-align:left">index_col</td>
        <td style="text-align:left">Column to use as the row labels of the DataFrame.</td>
    </tr>
    <tr style="border-bottom:solid">
        <td style="text-align:left">encoding</td>
        <td style="text-align:left">Encoding format, commonly 'gbk' or 'utf-8'.</td>
    </tr>
</table>

```{note}
- When reading certain data files, you may need to add the decoding parameter `encoding='gbk'` or `encoding='utf-8'` for proper reading.
```

Another common data file format is CSV. We can simply use Pandas' `read_csv` method, whose syntax is essentially the same as `read_excel`.

### Store the data
<hr>

To save data, use the `to_excel` or `to_csv` method. For example, to save our DataFrame df to the "datas/" folder with the filename "marks.xlsx":

In [367]:
df.to_excel("datas/marks.xlsx")

- The folder must first exists in the computer before using `to_excel` or `to_csv`.
- By default, the row indeices are not written to the file. If you want to include the index in the saved file, you can set `index=True` (the default is index=False).

## Access and change data
<hr>

To quickly view the statistical summary of each column in a DataFrame, you can use the `describe()` method. It includes information such as the number of non-null values, mean, standard deviation, minimum, maximum, and quartiles for each column.

In [368]:
df.describe()

       Name Statistics Accounting Marketing
count     3          3          3         3
unique    3          3          3         3
top     Jim         85         82        84
freq      1          1          1         1

Additionally, there are several useful method:

| method | Description                       |
| ------- | -------------------------------- |
| `info()` | View the data type of each column |
| `head()` | View the first 5 rows of the data |
| `tail()` | View the last 5 rows of the data  |

### Access the data of a single row, column or cell
<hr>

The simplest way to view a specific column of data is by entering the column name within square brackets `[ ]`. For example, to view the 'Marketing' scores column:

In [395]:
df['Marketing']

0    84.0
1    90.0
2    78.0
Name: Marketing, dtype: float64

To view a particular row of data, use the `loc[ ]` method with the row index.

In [370]:
df.loc[0]  # show the data of the first row

Name          Jim
Statistics     85
Accounting     82
Marketing      84
Name: 0, dtype: object

In [371]:
df.loc[2]  # show the data of the 3rd row

Name          Jack
Statistics      90
Accounting      88
Marketing       78
Name: 2, dtype: object

To view a specific cell, a convenient method is to use double square brackets `[ ][ ]`, with the column label and row index inside each bracket respectively.

In [372]:
df["Marketing"][1]

'90'

### Acess multi-row or multi-column data
<hr>

To view multiple rows and columns of data, you can use `iloc[ ]`, which not only allows accessing multiple rows and columns but also supports retrieving single rows, single columns, or even individual cell data.。

In [373]:
df.iloc[1] # view the data in the 2nd row

Name          Lily
Statistics      68
Accounting      63
Marketing       90
Name: 1, dtype: object

In [374]:
df.iloc[0:2] # view the data of the first 2 rows

   Name Statistics Accounting Marketing
0   Jim         85         82        84
1  Lily         68         63        90

In [375]:
df.iloc[[0, 2]]  # view the data of the 1st and the 3rd rows

   Name Statistics Accounting Marketing
0   Jim         85         82        84
2  Jack         90         88        78

- View the column data with `[:, ]`.

In [376]:
df.iloc[:, 1]  # view the data of the 2nd column

0    85
1    68
2    90
Name: Statistics, dtype: object

In [377]:
df.iloc[:, 0:2]  # view the data of the first 2 columns

   Name Statistics
0   Jim         85
1  Lily         68
2  Jack         90

In [378]:
df.iloc[:, [0, 2]]  # view the data of the 1st and 3rd columns

   Name Accounting
0   Jim         82
1  Lily         63
2  Jack         88

- View the data in a block.

In [379]:
df.iloc[0:2, 0:2] # view the data in the first 2 rows and the first 2 columns

   Name Statistics
0   Jim         85
1  Lily         68

In [380]:
df.iloc[[0, 2], [0, 2]]  # view the data in row 1 and 3, column 1 and 3

   Name Accounting
0   Jim         82
2  Jack         88

In [381]:
df.iloc[[0, 2], 0:2]  # view the data in row 1 and 3, column 1 and 2

   Name Statistics
0   Jim         85
2  Jack         90

- View the data in some cell.

In [382]:
df.iloc[1, 1]  # view the data in the cell of row 1 and column 1

'68'

To view specific columns of data, in addition to using `iloc`, you can **directly pass a list of column labels inside square brackets `[ ]`**.

In [383]:
df[["Statistics", "Marketing"]]

  Statistics Marketing
0         85        84
1         68        90
2         90        78

It is same as the following:

In [384]:
df.iloc[:, [1, 3]]

  Statistics Marketing
0         85        84
1         68        90
2         90        78

### View the statistical values of the data
<hr>

Pandas provides built-in statistical method to calculate summary statistics for column data. These method include: `mean()` (average), `max()` (maximum), `min()` (minimum), `median()`, `std()` (standard deviation), `count()`, `skew()` (skewness), `quantile()`, and more. In some cases, you may need to specify the parameter `numeric_only=True` to ensure the method is only applied to numeric columns.

- Sometimes we may need to cast the data types to numeric before using those methods.

In [389]:
df
print(type(df['Statistics'][1]))

<class 'numpy.float64'>

In [388]:
df[['Statistics', 'Accounting', 'Marketing']] = df[['Statistics', 'Accounting', 'Marketing']].astype(float)
df

   Name  Statistics  Accounting  Marketing
0   Jim        85.0        82.0       84.0
1  Lily        68.0        63.0       90.0
2  Jack        90.0        88.0       78.0

In [357]:
df["Statistics"].mean()

81.0

In [ ]:
# to calculate the average score for each course
# since the first column ('names') is non-numeric, the parameter numeric_only=True is added.`
df.mean(numeric_only=True)

In [ ]:
df["Accounting"].max()

- Using 'axis=1' to apply the function to rows

In [ ]:
df.mean(numeric_only=True, axis=1)  # computer the average score of each student

###  Revise data
<hr>

When modifying data in a pandas DataFrame, you can assign new values based on pandas index positions: **either assigning a column/row to a single value or to a list with equal length**, using `[ ]` and `.iloc[]`, respectively.

In [ ]:
df["Accounting"] = 80  # revise all the accounting scores to 80
df

In [ ]:
df["Accounting"] = [64, 76, 88]  # revise the accounting scores to be the list values
df

In [336]:
df.iloc[1] = 80  # revise all the values in row 2 to 80
df

   Name Statistics Accounting Marketing
0   Jim         85         82        84
1    80         80         80        80
2  Jack         90         88        78

In [337]:
df.iloc[1] = ["Ella", 95, 90, 89]  # revise all the values in row 2 to the list values
df

   Name Statistics Accounting Marketing
0   Jim         85         82        84
1  Ella         95         90        89
2  Jack         90         88        78

Revise the value in some cell:

In [338]:
df.iloc[1, 1] = 55  
df

   Name Statistics Accounting Marketing
0   Jim         85         82        84
1  Ella         55         90        89
2  Jack         90         88        78

To change the data type of column, using method `astype()`.

In [342]:
df['Marketing'].astype(float)

0    84.0
1    89.0
2    78.0
Name: Marketing, dtype: float64

## Add, delete and merge data
<hr>

### Add data
<hr>

To add a new column at the end of the original data, the syntax is similar to revising the data, using `[ ]` and `.loc[ ]` for adding columns or rows:

In [151]:
df["Python Programming"] = 60 # add one column of data in which all the values equal a single value
df

   Name  Statistics  Accounting  Marketing  Python Programming
0   Jim          85          64         84                  60
1  Ella          55          90         89                  60
2  Jack          90          88         78                  60

In [152]:
df["Financing"] = [60, 50, 70] # add one column of data in which the values equal to a list
df

   Name  Statistics  Accounting  Marketing  Python Programming  Financing
0   Jim          85          64         84                  60         60
1  Ella          55          90         89                  60         50
2  Jack          90          88         78                  60         70

To add a new row at the end of the original data, using `.loc[ ]`.
- not `.iloc[ ]`, which can't enlarge the DataFrame.

In [153]:
df.loc[3,:] = ["David", 65, 70, 69, 55, 83] 
df

    Name  Statistics  Accounting  Marketing  Python Programming  Financing
0    Jim        85.0        64.0       84.0                60.0       60.0
1   Ella        55.0        90.0       89.0                60.0       50.0
2   Jack        90.0        88.0       78.0                60.0       70.0
3  David        65.0        70.0       69.0                55.0       83.0

If inserting a column to specific index, using the method ``insert``.

In [154]:
df.insert(1, "Economy", [61, 72, 84, 81])  # insert a new column at column index 1
df

,Name,Economy,Statistics,Accounting,Marketing,Python Programming,Financing
0,Jim,61,85.0,64.0,84.0,60.0,60.0
1,Ella,72,55.0,90.0,89.0,60.0,50.0
2,Jack,84,90.0,88.0,78.0,60.0,70.0
3,David,81,65.0,70.0,69.0,55.0,83.0

To insert rows at a specific position, Pandas currently does not have a dedicated method for this operation. The common approach is to use the `concat()` method to combine multiple DataFrames. Additionally, both `concat()` and `merge()` can be used to add multiple columns or rows. For detailed usage, please refer to the "Merge Data" section later in this documentation.

### Delete data
<hr>

Pandas can use the `drop()` method to remove rows or columns. **To delete a row, specify the row index as the parameter along with `inplace=True`**. If the `inplace=True` parameter is omitted, the original DataFrame remains unchanged.

In [155]:
df.drop(3, inplace=True)  # delete the 3rd row
df

,Name,Economy,Statistics,Accounting,Marketing,Python Programming,Financing
0,Jim,61,85.0,64.0,84.0,60.0,60.0
1,Ella,72,55.0,90.0,89.0,60.0,50.0
2,Jack,84,90.0,88.0,78.0,60.0,70.0

- To delete a row, using `drop() ` with an additional parameter ``axis = 1``**

In [156]:
df.drop("Python Programming", inplace=True, axis=1)
df

   Name  Economy  Statistics  Accounting  Marketing  Financing
0   Jim       61        85.0        64.0       84.0       60.0
1  Ella       72        55.0        90.0       89.0       50.0
2  Jack       84        90.0        88.0       78.0       70.0

- To delete multi rows or columns, using `drop()` with the indices or lables in a list.

In [157]:
df.drop(["Marketing", "Financing"], inplace=True, axis=1)  # delete two columns
df

   Name  Economy  Statistics  Accounting
0   Jim       61        85.0        64.0
1  Ella       72        55.0        90.0
2  Jack       84        90.0        88.0

In [158]:
df.drop([0, 2], inplace=True) # delete two rows
df

   Name  Economy  Statistics  Accounting
1  Ella       72        55.0        90.0

- `drop()` method can drop data with conditions. For example:

In [162]:
df = pd.DataFrame(
    {
        "Name": ["Jim", "Lily", "Jack"],
        "Statistics": [85, 68, 90],
        "Accounting": [82, 63, 88],
        "Marketing": [84, 90, 78],
    }
)

df.drop(df[df["Statistics"]<70].index, inplace=True) # delete the rows in which the statistics score is higher than 70
df

   Name  Statistics  Accounting  Marketing
0   Jim          85          82         84
2  Jack          90          88         78

- Using `reset_index(drop=True)` to reset the row indices and drop the original indices

In [165]:
df.reset_index(drop=True)

   Name  Statistics  Accounting  Marketing
0   Jim          85          82         84
1  Jack          90          88         78

### Merge data
<hr>

In Pandas, two commonly used method for combining datasets are concat and merge.

- Use concat when the two DataFrames have identical column labels.

- In other cases, merge is typically preferred.

In [185]:
df1 = pd.DataFrame(
    {
        "Name": ["Jim", "Lily", "Jack"],
        "Statistics": [85, 68, 90],
        "Accounting": [82, 63, 88],
        "Marketing": [84, 90, 78],
    }
)

df1

   Name  Statistics  Accounting  Marketing
0   Jim          85          82         84
1  Lily          68          63         90
2  Jack          90          88         78

In [179]:
df2 = pd.DataFrame(
    {"Name": ["David", "Ella"], "Statistics": [83, 59], "Accounting": [62, 70], "Marketing": [64, 78]}
)
df2

    Name  Statistics  Accounting  Marketing
0  David          83          62         64
1   Ella          59          70         78

Since the two DataFrames have same column lables, using `concat([ ])`and put the two DataFrames **in a list** to merge.

In [174]:
pd.concat([df1, df2])  #  there are square brackets [ ]

    Name  Statistics  Accounting  Marketing
0    Jim          85          82         84
1   Lily          68          63         90
2   Jack          90          88         78
0  David          83          62         64
1   Ella          59          70         78

To rename the indexes after merging, you can add the parameter `ignore_index=True`, which will reassign sequential numeric indexes starting from 0 to the merged data.

In [175]:
pd.concat([df1, df2], ignore_index=True)

    Name  Statistics  Accounting  Marketing
0    Jim          85          82         84
1   Lily          68          63         90
2   Jack          90          88         78
3  David          83          62         64
4   Ella          59          70         78

- concat 默认按行合并，若按列合并，可以在小括号内添加参数`axis=1`

假如有下面的数据：

In [191]:
df3 = pd.DataFrame(
    {
        "Name": ["Jim", "Lily", "Jack"],
        "Python": [65, 68, 60],
        "Business Modelling": [72, 63, 78],
    }
)

df3

   Name  Python  Business Modelling
0   Jim      65                  72
1  Lily      68                  63
2  Jack      60                  78

In [188]:
df1

   Name  Statistics  Accounting  Marketing
0   Jim          85          82         84
1  Lily          68          63         90
2  Jack          90          88         78

When df1 and df3 share the same 'Name' column but have different other column names, and we want to add df3's columns to df1, we should use the `merge()` method. The typical syntax is as follows:

<table>
    <tr style="border-top:solid; border-bottom:solid">
        <th colspan=2 style="text-align:center">DataFrame.merge(right, how='inner', on=None)</th>
    </tr>
    <tr>
        <td style="text-align:left">right</td>
        <td style="text-align:left">The other DataFrame to merge;</td>
    </tr>
    <tr>
        <td rowspan=4 style="text-align:left">how</td>
        <td style="text-align:left">Default 'inner': performs inner join, merging only matching keys from both DataFrames</td>
    </tr>
    <tr>
        <td style="text-align:left">'outer': performs full outer join, merging all keys from both DataFrames</td>
    </tr>
    <tr>
        <td style="text-align:left">'left': performs left join, preserving all keys from the left DataFrame</td>
    </tr>
    <tr>
        <td style="text-align:left">'right': performs right join, preserving all keys from the right DataFrame</td>
    </tr>
    <tr style="border-bottom:solid">
        <td style="text-align:left">on</td>
        <td style="text-align:left">Column labels to join on (single or multiple)</td>
    </tr>
</table>

So, for df1 and df3, when using ``merge``, the matching key is 'Name':

In [192]:
df1.merge(df3, on="Name")

   Name  Statistics  Accounting  Marketing  Python  Business Modelling
0   Jim          85          82         84      65                  72
1  Lily          68          63         90      68                  63
2  Jack          90          88         78      60                  78

When merging DataFrames, Pandas will automatically fill missing values with NaN for non-matching fields. The following example demonstrates the results of different join method:

In [203]:
df1

   Name  Statistics  Accounting  Marketing
0   Jim          85          82         84
1  Lily          68          63         90
2  Jack          90          88         78

In [202]:
df4 = pd.DataFrame(
    {
        "Name": ["Jim", "Lily", "Robert"],
        "Python": [65, 78, 60],
        "Business Modelling": [72, 73, 68],
    }
)

df4

     Name  Python  Business Modelling
0     Jim      65                  72
1    Lily      78                  73
2  Robert      60                  68

In [204]:
df1.merge(df4, on="Name")

   Name  Statistics  Accounting  Marketing  Python  Business Modelling
0   Jim          85          82         84      65                  72
1  Lily          68          63         90      78                  73

In [205]:
df1.merge(df4, on="Name", how="outer")

     Name  Statistics  Accounting  Marketing  Python  Business Modelling
0    Jack        90.0        88.0       78.0     NaN                 NaN
1     Jim        85.0        82.0       84.0    65.0                72.0
2    Lily        68.0        63.0       90.0    78.0                73.0
3  Robert         NaN         NaN        NaN    60.0                68.0

In [207]:
df1.merge(df4, on="Name", how="left")

   Name  Statistics  Accounting  Marketing  Python  Business Modelling
0   Jim          85          82         84    65.0                72.0
1  Lily          68          63         90    78.0                73.0
2  Jack          90          88         78     NaN                 NaN

In [206]:
df1.merge(df4, on="Name", how="right")

     Name  Statistics  Accounting  Marketing  Python  Business Modelling
0     Jim        85.0        82.0       84.0      65                  72
1    Lily        68.0        63.0       90.0      78                  73
2  Robert         NaN         NaN        NaN      60                  68

## Search, sort and group the data
<hr>

### Search data
<hr>

When querying DataFrame data based on certain conditions, some comparison operators are commonly used, such as: `>`, `>=`, `==`, `<`, `<=`, `!=`. Conditional queries are generally applied only to column data. During the query process, **Pandas first generates a Boolean index (True or False)** and then produces the queried data by specifying this index.

In [217]:
import pandas as pd

df = pd.DataFrame(
    {
        "Name": ["Jim", "Lily", "Jack"],
        "Statistics": [85, 68, 90],
        "Accounting": [82, 63, 88],
        "Marketing": [84, 90, 78],
    }
)

df

   Name  Statistics  Accounting  Marketing
0   Jim          85          82         84
1  Lily          68          63         90
2  Jack          90          88         78

In [219]:
df["Statistics"] > 70  #  get the boolean index

0     True
1    False
2     True
Name: Statistics, dtype: bool

In [221]:
df[df["Statistics"] > 70]  # get the conditional data

   Name  Statistics  Accounting  Marketing
0   Jim          85          82         84
2  Jack          90          88         78

For multi-condition queries, you can use ``&`` to represent **AND** (both conditions must be satisfied) and ``|`` to represent **OR** (either condition can be satisfied). And, **each condition is in the paratheses `( )`**.

In [227]:
df[(df["Statistics"] > 70) & (df["Marketing"] > 80)]  # get the data where statistics score is greater than 70, and marketing score is greater than 80

  Name  Statistics  Accounting  Marketing
0  Jim          85          82         84

In [226]:
df[(df["Statistics"] > 70) | (df["Marketing"] > 80)]

   Name  Statistics  Accounting  Marketing
0   Jim          85          82         84
1  Lily          68          63         90
2  Jack          90          88         78

### Sort data
<hr>

When working with data, sorting is often necessary. Pandas provides a convenient method called `sort_values` for sorting numerical data. Its syntax is as follows:
<table>
     <tr style="border-top:solid; border-bottom:solid">
            <th colspan=2 style="text-align:center">DataFrame.sort_values(by, axis=0, ascending=True, inplace=False,  na_position='last', ignore_index=False)</th>
    </tr>
    <tr>
        <td style="text-align:left">by</td>
        <td style="text-align:left">Column labels to sort by (axis=0) or row indices (axis=1); multiple values allowed</td>
    </tr>
    <tr>
        <td style="text-align:left">axis</td>
        <td style="text-align:left">0 for column-wise sorting, 1 for row-wise sorting (default: 0)</td>
    </tr>
    <tr>
        <td style="text-align:left">ascending</td>
        <td style="text-align:left">Sort order: True for ascending, False for descending (default: True)</td>
    </tr>
    <tr>
        <td style="text-align:left">inplace</td>
        <td style="text-align:left">Whether to modify the DataFrame in place (default: False)</td>
    </tr>
    <tr>
        <td style="text-align:left">na_position</td>
        <td style="text-align:left">Position for missing values: 'first' or 'last' (default: 'last')</td>
    </tr>
    <tr style="border-bottom:solid">
        <td style="text-align:left">ignore_index</td>
        <td style="text-align:left">If True, the resulting axis will be labeled 0, 1, ..., n-1 (default: False)</td>
    </tr>
</table>
<br>

Sort the scores of Statistics in ascending order.

In [228]:
df.sort_values(by="Statistics")

   Name  Statistics  Accounting  Marketing
1  Lily          68          63         90
0   Jim          85          82         84
2  Jack          90          88         78

Sory the scores of both Statistics and Marketing in descending order.

In [229]:
df.sort_values(by=["Statistics", "Marketing"], ascending=False)

   Name  Statistics  Accounting  Marketing
2  Jack          90          88         78
0   Jim          85          82         84
1  Lily          68          63         90

For the parameter `by`, with "Statistics" preceding "Advanced Mathematics", it means: first sort by Statistics scores in descending order, and for entries with identical Statistics scores, then sort by Advanced Mathematics scores in descending order.

Since column labels often get shuffled during sorting:

- Use `ignore_index = True` to reset the index labels sequentially.

- Use `inplace = True` to modify the original DataFrame directly.

In [234]:
df.sort_values(by="Marketing", ignore_index=True)  # reset the index

   Name  Statistics  Accounting  Marketing
0  Jack          90          88         78
1   Jim          85          82         84
2  Lily          68          63         90

In [235]:
df.sort_values(by="Marketing", ignore_index=True)  
df # the original data keeps same

   Name  Statistics  Accounting  Marketing
0  Lily          68          63         90
1   Jim          85          82         84
2  Jack          90          88         78

In [236]:
df.sort_values(by="Marketing", ignore_index=True, inplace=True) 
df # the original data is changed after adding `inplace=True`

   Name  Statistics  Accounting  Marketing
0  Jack          90          88         78
1   Jim          85          82         84
2  Lily          68          63         90

### Group the data `groupby`
<hr>

In data analysis, it's often necessary to group and aggregate data. For example, when analyzing students' final exam scores, you might need to calculate average scores, highest scores, etc. by major or class. Pandas' `groupby()` method conveniently implements these operations.

The `groupby` operation is frequently combined with aggregation method such as:

- mean (average)

- max (maximum value)

- min (minimum value)

- median (median)

- std (standard deviation)

- mad (mean absolute deviation)

- count (number of non-null values)

- size (total count, including nulls)

- skew (skewness)

- quantile (quantile values)

Below is a DataFrame about transcript.

In [257]:
df = pd.DataFrame(
    [
        ["Lily", "US", "5", 85, 68, 90],
        ["Tom", "UK", "6", 82, 63, 88],
        ["Jack", "India", "6", 84, 90, 78],
        ["David", "UK", "6", 75, 68, 80],
        ["Ella", "India", "5", 69, 55, 63],
        ["Julie", "China", "5", 89, 95, 93],
    ],
    columns=["Name", "Nation", "Level", "Statistics", "Accounting", "Finance"],
)
df

    Name Nation Level  Statistics  Accounting  Finance
0   Lily     US     5          85          68       90
1    Tom     UK     6          82          63       88
2   Jack  India     6          84          90       78
3  David     UK     6          75          68       80
4   Ella  India     5          69          55       63
5  Julie  China     5          89          95       93

In [251]:
df.groupby("Level").count() # group by 'Level'

       Name  Nation  Statistics  Accounting  Finance
Level
5         4       4           4           4        4
6         2       2           2           2        2

In [241]:
df.groupby("Level").size()

Level
5    4
6    2
dtype: int64

- Use `numeric_only = True` to operate only on the numeric values

In [246]:
df.groupby("Level").mean(
    numeric_only=True
)  # Get the mean scores for each module by "Level"

       Statistics  Accounting  Finance
Level
5           81.25       70.25     83.5
6           79.50       79.00     79.0

In [260]:
df.groupby(["Nation", "Level"]).mean(numeric_only=True)

              Statistics  Accounting  Finance
Nation Level
China  5            89.0        95.0     93.0
India  5            69.0        55.0     63.0
       6            84.0        90.0     78.0
UK     6            78.5        65.5     84.0
US     5            85.0        68.0     90.0

We can assign the data after grouping to a new DataFrame.

In [262]:
df2 = df.groupby(["Nation", "Level"]).mean(numeric_only=True) 
df2

              Statistics  Accounting  Finance
Nation Level
China  5            89.0        95.0     93.0
India  5            69.0        55.0     63.0
       6            84.0        90.0     78.0
UK     6            78.5        65.5     84.0
US     5            85.0        68.0     90.0

In [263]:
df2.index

MultiIndex([('China', '5'),
            ('India', '5'),
            ('India', '6'),
            (   'UK', '6'),
            (   'US', '5')],
           names=['Nation', 'Level'])

### Method `reset_index()` or parameter `as_index=False`
<hr>

The indices of a DataFrame often change after Pandas processing, as have mentioned before, we have two ways to stop the changes.

- Use a method `reset_index()` after `goupby()`.
- Use a parameter `as_index=False` inside `groupby()`.

In [282]:
df2 = df.groupby(["Nation", "Level"]).mean(numeric_only=True).reset_index()
df2

  Nation Level  Statistics  Accounting  Finance
0  China     5        89.0        95.0     93.0
1  India     5        69.0        55.0     63.0
2  India     6        84.0        90.0     78.0
3     UK     6        78.5        65.5     84.0
4     US     5        85.0        68.0     90.0

In [267]:
df2 = df.groupby(["Nation", "Level"], as_index=False).mean(numeric_only=True)
df2

  Nation Level  Statistics  Accounting  Finance
0  China     5        89.0        95.0     93.0
1  India     5        69.0        55.0     63.0
2  India     6        84.0        90.0     78.0
3     UK     6        78.5        65.5     84.0
4     US     5        85.0        68.0     90.0

Sometimes, the `reset_index()` method can be used with the `drop=True` parameter to remove the index.

The `reset_index()` method can also use the `names` parameter to rename column headers.

In [283]:
df2 = (
    df.groupby(["Nation", "Level"]).mean(numeric_only=True).reset_index(names=["Class", "Gender"])
) 
df2

   Class Gender  Statistics  Accounting  Finance
0  China      5        89.0        95.0     93.0
1  India      5        69.0        55.0     63.0
2  India      6        84.0        90.0     78.0
3     UK      6        78.5        65.5     84.0
4     US      5        85.0        68.0     90.0

In [ ]:
df2.columns

## To a NumPy array or a list
<hr>

In Pandas, the `values` method can convert DataFrame data into a NumPy array format. For example, using the previous data example:

In [343]:
df.values

array([['Jim', '85', '82', '84'],
       ['Ella', 55, 90, 89],
       ['Jack', '90', '88', '78']], dtype=object)

In [344]:
df[["Statistics", "Accounting"]].values

array([['85', '82'],
       [55, 90],
       ['90', '88']], dtype=object)

You can also use the `tolist()` method to convert a column of data into Python's native list type.

In [393]:
df["Statistics"].tolist()

[85.0, 68.0, 90.0]

## Apply a method
<hr>

Pandas 可以使用``apply``调用自定义函数。

In [ ]:
import numpy as np

df["统计学"].apply(np.sqrt)  # 调用 Numpy 中的求平方根函数对统计学成绩每个元素求平方根

我们也可以使用``lambda``定义一个匿名函数在``apply``里面调用：

In [ ]:
df["高数新"] = df["高数"].apply(lambda x: x - 10)  # 对每一个高数成绩都减去 10 分，并赋值给一个新的列

``apply`` 也可以调用更复杂的自定义函数，例如，下面定义一个成绩替换函数，将分数替换为"优良中差"：

In [ ]:
def replace_score(x):
    if x >= 90:
        return "优"
    elif x >= 80:
        return "良"
    elif x >= 60:
        return "中"
    else:
        return "差"


df["英语"].apply(replace_score)

## 数据清洗
<hr>

### 数据替换``replace``, ``fillna``
<hr>

在进行数据处理时，经常需要对原始数据的一些异常值或错误值进行批量处理。 Pandas 提供了``replace``函数方便地进行这项操作。``replace``函数第一项为原数据中的值，第二项为需要替换的值。例如，有下面的学生成绩：

In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame(
    np.array([[85, 68, 90], [82, 63, 88], [84, 90, 78]]),
    columns=["统计学", "高数", "英语"],
    index=["张三", "李四", "王五"],
)
df

将其中的分数 90 替换为缺失值 NaN，注意，``replace``返回了一个新的数据，但原始数据并没有改变。

In [ ]:
df.replace(90, np.nan)

In [ ]:
df  # 原始数据并没有变

若需要原始数据改变，需要跟上参数``inplace = True ``，下面讲到的函数``fillna ``、``drop_duplicates``、``dropna``、 ``rename``等也可以跟这个参数将原始数据改变。

In [ ]:
df.replace(90, np.nan, inplace=True)
df  # 原始数据改变了

Pandas 提供``fillna``函数批量替换数据表中的缺失值 NaN。例如：

In [ ]:
df.fillna(80)  # 将缺失值替换为 80

In [ ]:
df.fillna("missing")  # 将缺失值替换为一个字符串

Pandas 还可以直接调用``isnull``函数判断数据是否为缺失值：

In [ ]:
df["英语"].isnull()

### 数据类型转换 ``astype``
<hr>

很多时候，我们需要对原始数据进行数据转换。例如，一些原始数据中的数字为文本类型，我们需要讲它们转化为数值类型才能进行之后的计算操作。常见的数据类型转换函数为``astype``。

In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame(
    np.array([["85", "68", "90"], ["82", "63", "88"], ["84", "90", "78"]]),
    columns=["统计学", "高数", "英语"],
    index=["张三", "李四", "王五"],
)
df

In [ ]:
print(df.dtypes)

上面的 pandas 数据为文本类型，我们利用``astype``将其转化为浮点型数值类型。

In [ ]:
df = df[["统计学", "高数", "英语"]].astype(float)
df

In [ ]:
print(df.dtypes)

改变`as_type`小括号中的参数为 int，str等，我们同样可以将原始数据转化为整数型，字符串型等。

### 重复值处理``drop_duplicates``
<hr>

在数据量比较大时，经常会遇到重复数据的问题，可以使用函数``drop_duplicates``将重复数据去掉。例如：

In [ ]:
df = pd.DataFrame(
    [
        ["一班", "男", 85, 68, 90],
        ["一班", "男", 85, 68, 90],
        ["二班", "女", 84, 90, 78],
        ["三班", "女", 75, 68, 80],
        ["二班", "女", 69, 55, 63],
        ["一班", "男", 89, 95, 93],
    ],
    columns=["班级", "性别", "统计学", "高数", "英语"],
    index=["张三", "张三", "王五", "马六", "陈小虎", "魏大帅"],
)
df

前两行的数据完全相同，使用函数``drop_duplicates``处理：

In [ ]:
df.drop_duplicates()

``drop_duplicates``的语法如下：

<table>
     <tr style="border-top:solid; border-bottom:solid">
            <th colspan=2 style="text-align:center">DataFrame.drop_duplicates(keep='first', inplace=False, ignore_index=False)</th>
    </tr>
    <tr>
        <td rowspan=3 style="text-align:left">keep</td>
        <td style="text-align:left">'fist'表示除了第一个重复的行都删除</td>
    </tr>
    <tr>
        <td style="text-align:left">'last'表示除了最后一个重复的行都删除</td>
    </tr>
    <tr>
        <td style="text-align:left">False 表示删除所有重复的行</td>
    </tr>
    <tr>
        <td style="text-align:left">inplace</td>
        <td style="text-align:left">若 inplace=True，表示处理后的数据替换原数据</td>
    </tr>
    <tr style="border-bottom:solid">
        <td style="text-align:left">ignore_index</td>
        <td style="text-align:left">如果为 True，则排序后的行号重新标号，默认是 False</td>
    </tr>
</table>
</br>

### 缺失值处理``drop_na``
<hr>

``dropna``函数可以将数据表中包含缺失值的行去除掉，与``drop_duplicates``的语法类似。它的语法如下：

<table>
     <tr style="border-top:solid; border-bottom:solid">
            <th colspan=2 style="text-align:center">DataFrame.dropna(axis=0, how='any', thresh=None, inplace=False, ignore_index=False)</th>
    </tr>
    <tr>
        <td style="text-align:left">axis</td>
        <td style="text-align:left">axis=0 表示删除含空值所在行，axis=1 表示删除含空值所在列</td>
    </tr>
    <tr>
        <td rowspan=2 style="text-align:left">how</td>
        <td style="text-align:left">默认为 how='any'，表示若有空值，就删除</td>
    </tr>
    <tr>  
        <td style="text-align:left">how='all'，表示全部是空值才删除该行或该列</td>
    </tr>
    <tr>
        <td style="text-align:left">thresh</td>
        <td style="text-align:left">空值的个数，作为行或列的删除标准</td>
    </tr>
    <tr>
        <td style="text-align:left">inplace</td>
        <td style="text-align:left">若 inplace=True，表示处理后的数据替换原数据</td>
    </tr>
    <tr style="border-bottom:solid">
        <td style="text-align:left">ignore_index</td>
        <td style="text-align:left">如果为 True，则排序后的行号重新标号，默认是 False</td>
    </tr>
</table>
</br>

In [ ]:
df = pd.DataFrame(
    {"统计学": [85, 68, np.nan], "高数": [82, 75, 88], "英语": [np.nan, 90, 78]},
    index=["张三", "李四", "王五"],
)
df

In [ ]:
df.dropna()  # 默认为删除含有空值的行，并且只要行里面有 Nan 值，就删除

In [ ]:
df.dropna(axis=1)  # 删除含有空值的列

In [ ]:
df.dropna(how="all")  # 全部是空值才删除

### 重命名``rename``
<hr>

在处理数据表时，有时候要给数据的行名或列名重命名，此时要用到``rename``函数，``rename``函数中的参数为一个字典形式：替换前的名字为字典的 key，替换后的名字为字典的 value。

In [ ]:
df = pd.DataFrame({"统计学": [85, 68, 90], "高数": [82, 63, 88], "英语": [84, 90, 78]})
df

In [ ]:
df.rename(columns={"统计学": "科目A", "高数": "科目B"})  # 更改其中两列的列名

```{admonition} tip
:class: tip
若要处理后的数据替换原数据，则要加参数``inplace=True``
```

##  时间序列数据处理
<hr>

### ``to_datetime`` 与 ``dt.strftime``
<hr>

实际工作中，经常会遇到大量的时间序列数据。这些时间序列的原始数据一般为文本格式，我们需要将它转化为时间日期格式。 Pandas 提供了 ``to_datetime``函数将其他日期时间格式转化为 Python 的日期时间格式。例如：

In [ ]:
import pandas as pd

pd.to_datetime("20200514")

In [ ]:
pd.to_datetime("2020/05/14")

In [ ]:
pd.to_datetime("2020-05-14")

在上面的代码中可以看出，``to_datetime``方法将不同类型的时间数据字符串转化为 Timestamp 格式：``年-月-日 时:分:秒``。另外一个函数``dt.strftime``可以将 Pandas 的 Timestamp 格式数据转化为其他格式的字符串，例如：

In [ ]:
df = pd.DataFrame(
    {
        "入校时间": ["2016-09-15", "2017-03-23", "2018-09-05"],
        "统计学": [85, 68, 90],
        "高数": [82, 63, 88],
        "英语": [84, 90, 78],
        "姓名": ["张三", "李四", "王五"],
    }
)
df

In [ ]:
df.iloc[0, 0]  # 原始数据中的时间为字符串

In [ ]:
df["入校时间"] = pd.to_datetime(df["入校时间"])  # 将原始数据中的时间转化为 python 的日期格式
df

In [ ]:
df.iloc[0, 0]

In [ ]:
df["入校时间"].dt.strftime("%m-%d-%y")  # 将日期格式转化为自定义格式的字符串

In [ ]:
df["入校时间"].dt.strftime("%B-%d-%y")  # 将日期格式转化为自定义格式的字符串，小写 Y 年份显示两位

In [ ]:
df["入校时间"].dt.strftime("%B-%d-%Y")  # 将日期格式转化为自定义格式的字符串，大写 Y 则年份显示四位

In [ ]:
df["入校时间"].dt.strftime("%Y-%W")  # 将日期格式转化为自定义格式的字符串，大写 W 显示的为该年第几周

In [ ]:
df["入校时间"].dt.strftime("%Y-%m-%w")  # 将日期格式转化为自定义格式的字符串，小写 w 显示的为该月第几周

###  数据聚合函数``resample``
<hr>

对于很多时间序列数据，有时候经常需要对它们按一定周期进行数据聚合，可以用 Pandas 提供的``resample``函数。resample 方法中的小括号中用不同参数表示聚合的频率。举例：

In [ ]:
import numpy as np

index = pd.date_range("12/24/2019", periods=10, freq="D")  # 生成一个时间序列，频率为天，周期数为 10
index

In [ ]:
df = pd.DataFrame(np.arange(10), index=index)  # 创建一个包含时间序列的 DataFrame 数据表
df

In [ ]:
df.resample("M").sum()  # 用 resample 方法按月('M')对数据聚合

In [ ]:
df.resample("3D").sum()  # 用 resample 方法每 3 天('3D')对数据聚合

In [ ]:
df.resample("w").sum()  # 用 resample 方法每周('w')对数据聚合

``resample``的其他参数中， ‘T’ 表示分钟，‘H’ 表示小时，除了跟``sum()``方法外，还可以跟``asfreq()``，``ffill``，``apply()``等。

## Pandas draw picutres*[^1]
<hr>

[^1]: \* means this section may not be delivered in class.

除了结合 matplotlib 与 seaborn 画图外，Pandas 也有自己的画图函数``plot``，它的语法一般为：

<table>
     <tr style="border-top:solid; border-bottom:solid">
            <th colspan=2 style="text-align:center">DataFrame.plot(x=None,y=None, kind='line',subplots=False, title=None)</th>
    </tr>
    <tr>
        <td style="text-align:left">x</td>
        <td style="text-align:left">横坐标数据</td>
    </tr>
    <tr>
        <td style="text-align:left">y</td>
        <td style="text-align:left">纵坐标数据</td>
    </tr>
    <tr>  
        <td style="text-align:left">kind</td>
        <td style="text-align:left">默认是线图，还可以是‘bar’,'barh','box','pie','scatter','hist'等</td>
    </tr>
    <tr>
        <td style="text-align:left">subplots</td>
        <td style="text-align:left">是否将每一列数据分别生成一个子图</td>
    </tr>
    <tr style="border-bottom:solid">
        <td style="text-align:left">title</td>
        <td style="text-align:left">图形的标题</td>
    </tr>
</table>
</br>

In [ ]:
import pandas as pd

df = pd.DataFrame(
    {"statistics": [85, 68, 90], "math": [82, 63, 88], "English": [84, 90, 78]}
)
df

In [ ]:
df.plot()

从上图可以看出，Pandas 的``plot``默认对每一列数据，画一个线图。

In [ ]:
df.plot(kind="bar", title="My picture")  # 画出柱状图

In [ ]:
df.plot(kind="bar", subplots=True)  # 对每一列数据非别生成一个子图

In [ ]:
df.plot(x="math", y="statistics", kind="scatter")  # 指定横坐标与纵坐标，生成一个散点图

```{admonition} tip
:class: tip
pandas 有大量处理数据的函数以及众多参数设置，限于篇幅关系，本书不详细赘述。读者使用 pandas 处理数据时，可以进一步查阅官方文档。
```

## Exercises
<hr>

```{exercise}
:label: creat-df
How to creat a DataFrame for the following panel data?

|Nation|Capital|
|--|--|
|UK|London|
|US|Washington DC|
|China|Beijing|
```

````{solution} creat-df
:class: dropdown
```python
import pandas as pd

df = pd.DataFrame({'Nation': ['UK', 'US', 'China'], 'Capital': ['London', 'Washinton DC', 'Beijing']})
```

or
```python
import pandas as pd
import numpy as pd

data = np.array([['UK', 'US', 'China'], ['London', 'Washinton DC', 'Beijing']])
df = pd.DataFrame(data, columns=['Nation', 'Capital'])
```

````

```{exercise}
:label: read-csv
How to read a CSV file into a Pandas DataFrame?

A.&nbsp;&nbsp;  pd.load_csv()

B.&nbsp;&nbsp;  pd.read_csv()

C.&nbsp;&nbsp;  pd.open_csv()

D.&nbsp;&nbsp;  pd.import_csv()


```

````{solution} read-csv
:class: dropdown
B
````

```{exercise}
:label: row-index
What is the default index type when a DataFrame is created?

A.&nbsp;&nbsp;  Numeric index starting from 1

B.&nbsp;&nbsp;  Alphanumeric index based on row number

C.&nbsp;&nbsp;  Numeric index starting from 0

D.&nbsp;&nbsp;  Strings


```

````{solution} row-index
:class: dropdown
C
````

```{exercise}
:label: pandas-read
自定义一个包含10个学生，3门课程的成绩单 excel 文件，其中包含不及格的数据。用 pandas 读取该文件，剔除有成绩不及格的学生条目，并输出剩下成绩单各科目的平均成绩，最高成绩；最后将剩下学生所有科目的平均成绩排序并输出名次。
```

<script src="https://giscus.app/client.js"
        data-repo="robinchen121/book-Python-Data-Science"
        data-repo-id="R_kgDOKFdyOw"
        data-category="Announcements"
        data-category-id="DIC_kwDOKFdyO84CgWHi"
        data-mapping="pathname"
        data-strict="0"
        data-reactions-enabled="1"
        data-emit-metadata="0"
        data-input-position="bottom"
        data-theme="light"
        data-lang="en"
        crossorigin="anonymous"
        async>
</script>

<!-- Toogle google translation -->
<div id="google_translate_element"></div>
<script type="text/javascript">
      function googleTranslateElementInit() {
        new google.translate.TranslateElement({ pageLanguage: 'zh-CN',
                  includedLanguages: 'en,zh-CN,zh-TW,ja,ko,de,ru,fr,es,it,pt,hi,ar,fa',
layout: google.translate.TranslateElement.InlineLayout.SIMPLE }, 'google_translate_element');
      }
</script>
<script type="text/javascript"
      src="https://translate.google.com/translate_a/element.js?cb=googleTranslateElementInit"
></script>
<br>

<script src="https://giscus.app/client.js"
        data-repo="robinchen121/book-Python-Data-Science"
        data-repo-id="R_kgDOKFdyOw"
        data-category="Announcements"
        data-category-id="DIC_kwDOKFdyO84CgWHi"
        data-mapping="pathname"
        data-strict="0"
        data-reactions-enabled="1"
        data-emit-metadata="0"
        data-input-position="bottom"
        data-theme="light"
        data-lang="en"
        crossorigin="anonymous"
        async>
</script>